# Дана последовательность чисел. Получить список уникальных элементов заданной последовательности.
# Пример: [1, 2, 3, 5, 1, 5, 3, 10] => [2, 10]

from os import system
system("cls")


seq = [1, 2, 3, 5, 1, 5, 3, 10]
res = [i for i in seq if seq.count(i) == 1]
print(f'{seq} => {res}')